[{
  "name": "No Strict-Transport-Security Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#hsts",
  "detail": "HTTP Strict Transport Security (HSTS) is a web security policy mechanism which helps to protect websites against protocol downgrade attacks and cookie hijacking. It allows web servers to declare that web browsers (or other complying user agents) should only interact with it using secure HTTPS connections, and never via the insecure HTTP protocol. HSTS is an IETF standards track protocol and is specified in RFC 6797. A server implements an HSTS policy by supplying a header (Strict-Transport-Security) over an HTTPS connection (HSTS headers over HTTP are ignored).",
  "remediation": "Set the header on all pages to Strict-Transport-Security: max-age=31536000 ; includeSubDomains",
  "checks": {
    "mimes": [],
    "check": "Strict-Transport-Security"
  }
},
{
  "name": "No Public-Key-Pins Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#hpkp",
  "detail": "HTTP Public Key Pinning (HPKP) is a security mechanism which allows HTTPS websites to resist impersonation by attackers using mis-issued or otherwise fraudulent certificates. (For example, sometimes attackers can compromise certificate authorities, and then can mis-issue certificates for a web origin.).<br>The HTTPS web server serves a list of public key hashes, and on subsequent connections clients expect that server to use one or more of those public keys in its certificate chain. Deploying HPKP safely will require operational and organizational maturity due to the risk that hosts may make themselves unavailable by pinning to a set of public key hashes that becomes invalid. With care, host operators can greatly reduce the risk of man-in-the-middle (MITM) attacks and other false authentication problems for their users without incurring undue risk.",
  "remediation": "Set the header on all pages to something similar to Public-Key-Pins: pin-sha256=\"d6qzRu9zOECb90Uez27xWltNsj0e1Md7GkYYkVoZWmM=\"; pin-sha256=\"E9CZ9INDbd+2eRQozYqqbQ2yXLVKB9+xcprMF+44U1g=\"; report-uri=\"http://example.com/pkp-report\"; max-age=10000; includeSubDomains",
  "checks": {
    "mimes": [],
    "check": "Public-Key-Pins"
  }
},
{
  "name": "No X-Frame-Options Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#xfo",
  "detail": "X-Frame-Options response header improve the protection of web applications against Clickjacking. It declares a policy communicated from a host to the client browser on whether the browser must not display the transmitted content in frames of other web pages.",
  "remediation": "Set the header on all pages to X-Frame-Options: deny",
  "checks": {
    "mimes": [],
    "check": "X-Frame-Options"
  }
},
{
  "name": "No X-XSS-Protection Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#xxxsp",
  "detail": "This header enables the Cross-site scripting (XSS) filter in your browser.",
  "remediation": "Set the header on all pages to X-XSS-Protection: 1; mode=block",
  "checks": {
    "mimes": [],
    "check": "X-XSS-Protection"
  }
},
{
  "name": "No X-Content-Type-Options Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#xcto",
  "detail": "Setting this header will prevent the browser from interpreting files as something else than declared by the content type in the HTTP headers.",
  "remediation": "Set the header on all pages to X-Content-Type-Options: nosniff",
  "checks": {
    "mimes": [],
    "check": "X-Content-Type-Options"
  }
},
{
  "name": "No Content-Security-Policy Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#csp",
  "detail": "Content Security Policy (CSP) requires careful tuning and precise definition of the policy. If enabled, CSP has significant impact on the way browser renders pages (e.g., inline JavaScript disabled by default and must be explicitly allowed in policy). CSP prevents a wide range of attacks, including Cross-site scripting and other cross-site injections.",
  "remediation": "Set the header on all pages to Content-Security-Policy: script-src 'self'",
  "checks": {
    "mimes": [],
    "check": "Content-Security-Policy: script-src 'self'"
  }
},
{
  "name": "No X-Permitted-Cross-Domain-Policies Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#xpcdp",
  "detail": "A cross-domain policy file is an XML document that grants a web client, such as Adobe Flash Player or Adobe Acrobat (though not necessarily limited to these), permission to handle data across domains. When clients request content hosted on a particular source domain and that content make requests directed towards a domain other than its own, the remote domain needs to host a cross-domain policy file that grants access to the source domain, allowing the client to continue the transaction. Normally a meta-policy is declared in the master policy file, but for those who can’t write to the root directory, they can also declare a meta-policy using the X-Permitted-Cross-Domain-Policies HTTP response header.",
  "remediation": "Set the header on all pages to X-Permitted-Cross-Domain-Policies: none",
  "checks": {
    "mimes": [],
    "check": "X-Permitted-Cross-Domain-Policies"
  }
},
{
  "name": "No Referrer-Policy Header",
  "severity": "Low",
  "confidence": "Certain",
  "background": "https://www.owasp.org/index.php/OWASP_Secure_Headers_Project#rp",
  "detail": "The Referrer-Policy HTTP header governs which referrer information, sent in the Referer header, should be included with requests made.",
  "remediation": "Set the header on all pages to Referrer-Policy: no-referrer",
  "checks": {
    "mimes": [],
    "check": "Referrer-Policy"
  }
}]